# Coding Exercise #0105

### 1. Pandas DataFrame basics:

In [1]:
import pandas as pd
import numpy as np
import os

#### 1.1. Creating a new DataFrame:

From a dictionary:

In [2]:
data = { 'NAME' : ['Jake', 'Jennifer', 'Paul', 'Andrew'], 'AGE': [24,21,25,19], 'GENDER':['M','F','M','M']}
df = pd.DataFrame(data)
df

       NAME  AGE GENDER
0      Jake   24      M
1  Jennifer   21      F
2      Paul   25      M
3    Andrew   19      M

From a NumPy array:

In [3]:
df = pd.DataFrame(np.random.rand(10,5), columns=['A','B','C','D','E'])
df.head(3)

          A         B         C         D         E
0  0.368861  0.493590  0.493938  0.443145  0.108306
1  0.458022  0.290993  0.908923  0.881967  0.763469
2  0.066142  0.293843  0.811495  0.879241  0.837426

#### 1.2. Reading data into a DataFrame:

In [4]:
# Go to the directory where the data file is located. 
os.chdir(r'./')                # Please, replace the path with your own.

In [5]:
!pwd

/Users/cchyun/Workspace/emcast_ws/01_SIC AI 과정/02_AI과정 업데이트 결과물/03_Chapter Exercise/01_Ch 03

In [6]:
df = pd.read_csv('data_studentlist.csv', header='infer')

Check for some of the DataFrame attributes:

In [7]:
df.shape

(17, 8)

In [8]:
df.size

136

In [9]:
df.ndim

2

In [10]:
df.columns

Index(['name', 'gender', 'age', 'grade', 'absence', 'bloodtype', 'height',
       'weight'],
      dtype='object')

In [11]:
df.index

RangeIndex(start=0, stop=17, step=1)

In [12]:
type(df)

pandas.core.frame.DataFrame

Summarize the DataFrame:

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17 entries, 0 to 16
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   name       17 non-null     object
 1   gender     17 non-null     object
 2   age        17 non-null     int64
 3   grade      17 non-null     int64
 4   absence    17 non-null     object
 5   bloodtype  17 non-null     object
 6   height     17 non-null     float64
 7   weight     17 non-null     float64
dtypes: float64(2), int64(2), object(4)
memory usage: 1.2+ KB

In [14]:
df.describe()

             age      grade      height     weight
count  17.000000  17.000000   17.000000  17.000000
mean   22.352941   2.294118  170.035294  61.064706
std     1.169464   1.104802    7.849756  11.851685
min    20.000000   1.000000  155.200000  45.200000
25%    22.000000   1.000000  165.300000  53.000000
50%    22.000000   2.000000  169.200000  61.300000
75%    23.000000   3.000000  176.100000  68.200000
max    24.000000   4.000000  182.100000  85.700000

Show the head and tail parts:

In [15]:
df.head(3)

             name gender  age  grade absence bloodtype  height  weight
0   Jared Diamond      M   23      3       Y         O   165.3    68.2
1  Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
2    Brian Martin      M   24      4       N         B   175.0    80.1

In [16]:
df.tail(3)

              name gender  age  grade absence bloodtype  height  weight
14    Linda Carter      F   22      2       N         B   158.2    45.2
15  Richard Swayze      M   24      4       Y         B   168.6    70.2
16     Andrew King      M   21      1       N         A   169.2    62.2

Replacing the 'columns' (header):

In [17]:
header = df.columns
header

Index(['name', 'gender', 'age', 'grade', 'absence', 'bloodtype', 'height',
       'weight'],
      dtype='object')

In [18]:
df.columns = ['NAME', 'GENDER' , 'AGE', 'GRADE', 'ABSENCE', 'BLOODTYPE', 'HEIGHT', 'WEIGHT']
df.head(3)

             NAME GENDER  AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
0   Jared Diamond      M   23      3       Y         O   165.3    68.2
1  Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
2    Brian Martin      M   24      4       N         B   175.0    80.1

#### 1.3. Indexing and slicing DataFrames:

In [19]:
# A column.
df.NAME

0        Jared Diamond
1       Sarah O'Donnel
2         Brian Martin
3         David Hassel
4      Clara Rodriquez
5     Jennifer Lorentz
6          Susan Clark
7      Margareth Jones
8         John Bertsch
9       Jake Timmerman
10       Joshua Connor
11        John Matsuda
12        Eddy Johnson
13    Rebecah Anderson
14        Linda Carter
15      Richard Swayze
16         Andrew King
Name: NAME, dtype: object

In [20]:
# This is in fact a Series:
type(df.NAME)

pandas.core.series.Series

In [21]:
# This is also a Series:
df['NAME']

0        Jared Diamond
1       Sarah O'Donnel
2         Brian Martin
3         David Hassel
4      Clara Rodriquez
5     Jennifer Lorentz
6          Susan Clark
7      Margareth Jones
8         John Bertsch
9       Jake Timmerman
10       Joshua Connor
11        John Matsuda
12        Eddy Johnson
13    Rebecah Anderson
14        Linda Carter
15      Richard Swayze
16         Andrew King
Name: NAME, dtype: object

In [22]:
# However, this is a DataFrame with one column, not a Series:
df[['NAME']]

                NAME
0      Jared Diamond
1     Sarah O'Donnel
2       Brian Martin
3       David Hassel
4    Clara Rodriquez
5   Jennifer Lorentz
6        Susan Clark
7    Margareth Jones
8       John Bertsch
9     Jake Timmerman
10     Joshua Connor
11      John Matsuda
12      Eddy Johnson
13  Rebecah Anderson
14      Linda Carter
15    Richard Swayze
16       Andrew King

In [23]:
# Another way of getting a columns as Series:
df.loc[:,'NAME']

0        Jared Diamond
1       Sarah O'Donnel
2         Brian Martin
3         David Hassel
4      Clara Rodriquez
5     Jennifer Lorentz
6          Susan Clark
7      Margareth Jones
8         John Bertsch
9       Jake Timmerman
10       Joshua Connor
11        John Matsuda
12        Eddy Johnson
13    Rebecah Anderson
14        Linda Carter
15      Richard Swayze
16         Andrew King
Name: NAME, dtype: object

In [24]:
df.loc[:,['NAME','GENDER']]

                NAME GENDER
0      Jared Diamond      M
1     Sarah O'Donnel      F
2       Brian Martin      M
3       David Hassel      M
4    Clara Rodriquez      F
5   Jennifer Lorentz      F
6        Susan Clark      F
7    Margareth Jones      F
8       John Bertsch      M
9     Jake Timmerman      M
10     Joshua Connor      M
11      John Matsuda      M
12      Eddy Johnson      M
13  Rebecah Anderson      F
14      Linda Carter      F
15    Richard Swayze      M
16       Andrew King      M

In [25]:
df.iloc[:,[0,1]]

                NAME GENDER
0      Jared Diamond      M
1     Sarah O'Donnel      F
2       Brian Martin      M
3       David Hassel      M
4    Clara Rodriquez      F
5   Jennifer Lorentz      F
6        Susan Clark      F
7    Margareth Jones      F
8       John Bertsch      M
9     Jake Timmerman      M
10     Joshua Connor      M
11      John Matsuda      M
12      Eddy Johnson      M
13  Rebecah Anderson      F
14      Linda Carter      F
15    Richard Swayze      M
16       Andrew King      M

In [26]:
df.loc[:,(header =='NAME') | (header == 'GENDER')]

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16]

In [27]:
# This is a row.
df.loc[2]

NAME         Brian Martin
GENDER                  M
AGE                    24
GRADE                   4
ABSENCE                 N
BLOODTYPE               B
HEIGHT              175.0
WEIGHT               80.1
Name: 2, dtype: object

In [28]:
df.loc[2:4]

              NAME GENDER  AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
2     Brian Martin      M   24      4       N         B   175.0    80.1
3     David Hassel      M   23      3       N        AB   182.1    85.7
4  Clara Rodriquez      F   20      1       Y         A   168.0    49.5

In [29]:
df.iloc[2:4]

           NAME GENDER  AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
2  Brian Martin      M   24      4       N         B   175.0    80.1
3  David Hassel      M   23      3       N        AB   182.1    85.7

In [30]:
df.drop(columns=['NAME','GENDER'])                  # This is just a view.
#df.drop(columns=['NAME','GENDER'],inplace=True)    # => To remove permanently.

    AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
0    23      3       Y         O   165.3    68.2
1    22      2       N        AB   170.1    53.0
2    24      4       N         B   175.0    80.1
3    23      3       N        AB   182.1    85.7
4    20      1       Y         A   168.0    49.5
5    21      2       N         O   162.0    52.0
6    22      1       N         O   155.2    45.3
7    23      1       N         A   176.9    55.0
8    23      3       N         B   178.5    64.2
9    22      2       N         B   176.1    61.3
10   24      4       Y         O   167.1    62.0
11   22      2       N        AB   180.0    75.8
12   21      1       N         A   162.2    55.3
13   23      3       N         O   176.1    53.1
14   22      2       N         B   158.2    45.2
15   24      4       Y         B   168.6    70.2
16   21      1       N         A   169.2    62.2

In [31]:
df.loc[:, (header!='NAME') & (header!='GENDER')]

                NAME GENDER  AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
0      Jared Diamond      M   23      3       Y         O   165.3    68.2
1     Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
2       Brian Martin      M   24      4       N         B   175.0    80.1
3       David Hassel      M   23      3       N        AB   182.1    85.7
4    Clara Rodriquez      F   20      1       Y         A   168.0    49.5
5   Jennifer Lorentz      F   21      2       N         O   162.0    52.0
6        Susan Clark      F   22      1       N         O   155.2    45.3
7    Margareth Jones      F   23      1       N         A   176.9    55.0
8       John Bertsch      M   23      3       N         B   178.5    64.2
9     Jake Timmerman      M   22      2       N         B   176.1    61.3
10     Joshua Connor      M   24      4       Y         O   167.1    62.0
11      John Matsuda      M   22      2       N        AB   180.0    75.8
12      Eddy Johnson      M   21      1       N         A   162.2    55.3
13  Rebecah Anderson      F   23      3       N         O   176.1    53.1
14      Linda Carter      F   22      2       N         B   158.2    45.2
15    Richard Swayze      M   24      4       Y         B   168.6    70.2
16       Andrew King      M   21      1       N         A   169.2    62.2

Conditional slicing:

In [32]:
# Males only.
df[df.GENDER == 'M']

              NAME GENDER  AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
0    Jared Diamond      M   23      3       Y         O   165.3    68.2
2     Brian Martin      M   24      4       N         B   175.0    80.1
3     David Hassel      M   23      3       N        AB   182.1    85.7
8     John Bertsch      M   23      3       N         B   178.5    64.2
9   Jake Timmerman      M   22      2       N         B   176.1    61.3
10   Joshua Connor      M   24      4       Y         O   167.1    62.0
11    John Matsuda      M   22      2       N        AB   180.0    75.8
12    Eddy Johnson      M   21      1       N         A   162.2    55.3
15  Richard Swayze      M   24      4       Y         B   168.6    70.2
16     Andrew King      M   21      1       N         A   169.2    62.2

In [33]:
# Only non-males.
df[-(df.GENDER == 'M')]

                NAME GENDER  AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
1     Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
4    Clara Rodriquez      F   20      1       Y         A   168.0    49.5
5   Jennifer Lorentz      F   21      2       N         O   162.0    52.0
6        Susan Clark      F   22      1       N         O   155.2    45.3
7    Margareth Jones      F   23      1       N         A   176.9    55.0
13  Rebecah Anderson      F   23      3       N         O   176.1    53.1
14      Linda Carter      F   22      2       N         B   158.2    45.2

In [34]:
df[df.GENDER == 'F']

                NAME GENDER  AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
1     Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
4    Clara Rodriquez      F   20      1       Y         A   168.0    49.5
5   Jennifer Lorentz      F   21      2       N         O   162.0    52.0
6        Susan Clark      F   22      1       N         O   155.2    45.3
7    Margareth Jones      F   23      1       N         A   176.9    55.0
13  Rebecah Anderson      F   23      3       N         O   176.1    53.1
14      Linda Carter      F   22      2       N         B   158.2    45.2

In [35]:
df[df.HEIGHT > 170]

                NAME GENDER  AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
1     Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
2       Brian Martin      M   24      4       N         B   175.0    80.1
3       David Hassel      M   23      3       N        AB   182.1    85.7
7    Margareth Jones      F   23      1       N         A   176.9    55.0
8       John Bertsch      M   23      3       N         B   178.5    64.2
9     Jake Timmerman      M   22      2       N         B   176.1    61.3
11      John Matsuda      M   22      2       N        AB   180.0    75.8
13  Rebecah Anderson      F   23      3       N         O   176.1    53.1

In [36]:
df[ (df.WEIGHT > 70) & (df.WEIGHT < 80)]

              NAME GENDER  AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
11    John Matsuda      M   22      2       N        AB   180.0    75.8
15  Richard Swayze      M   24      4       Y         B   168.6    70.2

In [37]:
df[ (df.GENDER == 'M') & (df.HEIGHT > 175)]

              NAME GENDER  AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
3     David Hassel      M   23      3       N        AB   182.1    85.7
8     John Bertsch      M   23      3       N         B   178.5    64.2
9   Jake Timmerman      M   22      2       N         B   176.1    61.3
11    John Matsuda      M   22      2       N        AB   180.0    75.8

In [38]:
# Opposite criteria to the previous one.
df[ -((df.GENDER == 'M') & (df.HEIGHT > 175))]

                NAME GENDER  AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
0      Jared Diamond      M   23      3       Y         O   165.3    68.2
1     Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
2       Brian Martin      M   24      4       N         B   175.0    80.1
4    Clara Rodriquez      F   20      1       Y         A   168.0    49.5
5   Jennifer Lorentz      F   21      2       N         O   162.0    52.0
6        Susan Clark      F   22      1       N         O   155.2    45.3
7    Margareth Jones      F   23      1       N         A   176.9    55.0
10     Joshua Connor      M   24      4       Y         O   167.1    62.0
12      Eddy Johnson      M   21      1       N         A   162.2    55.3
13  Rebecah Anderson      F   23      3       N         O   176.1    53.1
14      Linda Carter      F   22      2       N         B   158.2    45.2
15    Richard Swayze      M   24      4       Y         B   168.6    70.2
16       Andrew King      M   21      1       N         A   169.2    62.2

#### 1.4. File reading and writing:

Read and write in the CSV format:

In [39]:
df2 = df.drop(columns=['GRADE','ABSENCE'])
df2.to_csv('data_mine.csv',index=False)

In [40]:
df3 = pd.read_csv('data_mine.csv',encoding='latin1',header='infer')

In [41]:
df3.head(3)

             NAME GENDER  AGE BLOODTYPE  HEIGHT  WEIGHT
0   Jared Diamond      M   23         O   165.3    68.2
1  Sarah O'Donnel      F   22        AB   170.1    53.0
2    Brian Martin      M   24         B   175.0    80.1

Read and write as a Excel document:

In [42]:
dfx = pd.read_excel('data_studentlist.xlsx', sheet_name='Sheet1')

In [43]:
dfx.head(5)

              name gender  age  grade absence bloodtype  height  weight
0    Jared Diamond      M   23      3       Y         O   165.3    68.2
1   Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
2     Brian Martin      M   24      4       N         B   175.0    80.1
3     David Hassel      M   23      3       N        AB   182.1    85.7
4  Clara Rodriquez      F   20      1       Y         A   168.0    49.5

In [44]:
dfx.to_excel('data_studentlist2.xlsx',sheet_name='NewSheet', index=False)

### Added

Data frame objects are generated in various ways, but the optimal way is to use dictionaries in lists of the same length or to use Numpy arrays. The index of the created data frame is automatically substituted in the same way as the series, and the columns are sorted and stored.

In [45]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

Using the head method, only five rows can be designated or printed.

In [46]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

IF columns are designated in the desired order, data frame objects are greated accordingly.

In [47]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

Like the series, if you pass a value that is not in the dictionary, it is stored as a missing value.

In [48]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                      index=['one', 'two', 'three', 'four',
                             'five', 'six'])

In [49]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [50]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

Columnns of data frames, like the series, can be approached in dictionary notation or attribute format.

In [51]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [52]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

If the returned series object has an index such as a data frame, the name attribute is filled with the appropriate value. Rows can be accessed by name using a loc attribute or location.

In [53]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

Columns can be substituted. For example, a scalar value or an array value may be substituted into the currently empty 'debt' column.

In [54]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [55]:
frame2['debt'] = np.arange(6.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

When substituting a list or array into a column, the length of the value to be substituted must be equal to the size of the data frame. When a series is substituted, values are substituted according to the index of the data frame, and missing values are substituted for indeces that do not exist.

In [56]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

Let's try to use more functions using other examples of 2D arrays, as shown below.

In [57]:
df = pd.DataFrame([[15, 'male', 'A_middle_school'], [17, 'female', 'B_middle_school']], 
                   index=['JunSeo', 'YeEun'],
                   columns=['age', 'sex', 'school'])

In order to apply the rename() method to the data frame, it may be changed by selecting a row index or a part of a column name. Among the column names, change "age" to "years", "sex" to "gender", and "school" to "middle_school".

However, since it returns a new data frame object rather than directly modifying the original object, use the inplace=True option to change the original object.

In [58]:
df.rename(columns={'age':'years', 'sex':'gender', 'school':'middle_school'}, inplace=True)

Among the row indexes of df, change "Junseo" to "stu1" and "YeEun" to "stu2".

In [59]:
df.rename(index={'JunSeo':'stu1', 'YeEun':'stu2' }, inplace=True)

In [60]:
df

      years  gender    middle_school
stu1     15    male  A_middle_school
stu2     17  female  B_middle_school

Replicate the data frame df and store it in the variable df2. Delete one row of df2.

In [61]:
exam_data = {'math' : [ 90, 80, 70], 'eng' : [ 98, 89, 95],
             'music' : [ 85, 95, 100], 'science' : [ 100, 90, 90]}
df = pd.DataFrame(exam_data, index=['stu1', 'stu2', 'stu3'])
df

      math  eng  music  science
stu1    90   98     85      100
stu2    80   89     95       90
stu3    70   95    100       90

In [62]:
df2 = df[:]
df2.drop('stu2', inplace=True)

/var/folders/zt/d4hf1bc92d5527jl1y_x0drc0000gn/T/ipykernel_6246/3160518539.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2.drop('stu2', inplace=True)

In [63]:
df2

      math  eng  music  science
stu1    90   98     85      100
stu3    70   95    100       90

In [64]:
# Replicate the data frame df and store it in the variable df3. Delete two rows of df3.
df3 = df[:]
df3.drop(['stu2', 'stu3'], axis=0, inplace=True)
df3

/var/folders/zt/d4hf1bc92d5527jl1y_x0drc0000gn/T/ipykernel_6246/3564814535.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3.drop(['stu2', 'stu3'], axis=0, inplace=True)

      math  eng  music  science
stu1    90   98     85      100

In [65]:
# Replicate the data frame df and store it in the variable df4. Delete one column of df4.
df4 = df[:]
df4.drop('math', axis=1, inplace=True)
df4

/var/folders/zt/d4hf1bc92d5527jl1y_x0drc0000gn/T/ipykernel_6246/2900724097.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df4.drop('math', axis=1, inplace=True)

      eng  music  science
stu1   98     85      100
stu2   89     95       90
stu3   95    100       90

In [66]:
# Replicate the data frame df and store it in the variable df5. Delete two columns of df5. 
df5 = df[:]
df5.drop(['eng', 'music'], axis=1, inplace=True)
df5

/var/folders/zt/d4hf1bc92d5527jl1y_x0drc0000gn/T/ipykernel_6246/3886766029.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df5.drop(['eng', 'music'], axis=1, inplace=True)

      math  science
stu1    90      100
stu2    80       90
stu3    70       90

In [67]:
# Use the row index to select one row.
label1 = df.loc['stu1']    # Use the loc indexer
position1 = df.iloc[0]     # Use the iloc indexer
print(label1)
print('\n')
print(position1)

math        90
eng         98
music       85
science    100
Name: stu1, dtype: int64


math        90
eng         98
music       85
science    100
Name: stu1, dtype: int64

In [68]:
# Select two or more rows using the row index.
label2 = df.loc[['stu1', 'stu2']]
position2 = df.iloc[[0, 1]]
print(label2)
print('\n')
print(position2)

      math  eng  music  science
stu1    90   98     85      100
stu2    80   89     95       90


      math  eng  music  science
stu1    90   98     85      100
stu2    80   89     95       90

In [69]:
# Select a row by specifying the range of the row index.
label3 = df.loc['stu1':'stu2']
position3 = df.iloc[0:1]
print(label3)
print('\n')
print(position3)

      math  eng  music  science
stu1    90   98     85      100
stu2    80   89     95       90


      math  eng  music  science
stu1    90   98     85      100

In [70]:
# Select only the 'math' score data. Save to variable math1
math1 = df['math']
print(math1)
print(type(math1))

stu1    90
stu2    80
stu3    70
Name: math, dtype: int64
<class 'pandas.core.series.Series'>

In [71]:
# It should be noted that the results vary from series to data frames depending on the type of indexing.

In [72]:
# Select the 'music', 'science' score data. Save to variable music_sci
music_sci = df[['music', 'science']]
print(music_sci)

      music  science
stu1     85      100
stu2     95       90
stu3    100       90

In [73]:
print(type(music_sci))

<class 'pandas.core.frame.DataFrame'>

In [74]:
# Select only the 'math' score data. Save to variable math2
math2 = df[['math']]
print(math2)

      math
stu1    90
stu2    80
stu3    70

In [75]:
print(type(math2))

<class 'pandas.core.frame.DataFrame'>

In [76]:
exam_data = {'name' : [ 'stu1', 'stu2', 'stu3'],
             'math' : [ 90, 80, 70],
             'eng' : [ 98, 89, 95],
             'music' : [ 85, 95, 100],
             'science' : [ 100, 90, 90]}
df = pd.DataFrame(exam_data)
# Designating the column "name" as a new index and reflect changes to the df object.
df.set_index('name', inplace=True)
print(df)

      math  eng  music  science
name
stu1    90   98     85      100
stu2    80   89     95       90
stu3    70   95    100       90

In [77]:
# Select one specific element of the data frame df ('music' score of 'stu1')
a = df.loc['stu1', 'music']
print(a)
b = df.iloc[0, 2]
print(b)

85
85

In [78]:
# Select two or more specific elements of the data frame df ('music', 'science' scores of 'stu1') 
c = df.loc['stu1', ['music', 'science']]
print(c)
d = df.iloc[0, [2, 3]]
print(d)
e = df.loc['stu1', 'music':'science']
print(e)
f = df.iloc[0, 2:]
print(f)

music       85
science    100
Name: stu1, dtype: int64
music       85
science    100
Name: stu1, dtype: int64
music       85
science    100
Name: stu1, dtype: int64
music       85
science    100
Name: stu1, dtype: int64

In [79]:
# Select an element from two or more rows and columns of df ('music', 'science' scores of 'stu1' and stu2'))
g = df.loc[['stu1', 'stu2'], ['music', 'science']]
print(g)
h = df.iloc[[0, 1], [2, 3]]
print(h)
i = df.loc['stu1':'stu2', 'music':'science']
print(i)
j = df.iloc[0:2, 2:]
print(j)

      music  science
name
stu1     85      100
stu2     95       90
      music  science
name
stu1     85      100
stu2     95       90
      music  science
name
stu1     85      100
stu2     95       90
      music  science
name
stu1     85      100
stu2     95       90

In [80]:
# Add a 'history' score column to the data frame df. The value of the data is 80.
df['history'] = 80
print(df)

      math  eng  music  science  history
name
stu1    90   98     85      100       80
stu2    80   89     95       90       80
stu3    70   95    100       90       80

In [81]:
exam_data = {'name' : [ 'stu1', 'stu2', 'stu3'],
             'math' : [ 90, 80, 70],
             'eng' : [ 98, 89, 95],
             'music' : [ 85, 95, 100],
             'science' : [ 100, 90, 90]}
df = pd.DataFrame(exam_data)

In [82]:
# Add new row - enter the same element value
df.loc[3] = 0
print(df)

   name  math  eng  music  science
0  stu1    90   98     85      100
1  stu2    80   89     95       90
2  stu3    70   95    100       90
3     0     0    0      0        0

In [83]:
# Add new row - Enter an array of element values
df.loc[4] = ['stu4', 90, 80, 70, 60]
print(df)

   name  math  eng  music  science
0  stu1    90   98     85      100
1  stu2    80   89     95       90
2  stu3    70   95    100       90
3     0     0    0      0        0
4  stu4    90   80     70       60

In [84]:
# Add a new row - Copy an existing row
df.loc['row5'] = df.loc[3]
print(df)

      name  math  eng  music  science
0     stu1    90   98     85      100
1     stu2    80   89     95       90
2     stu3    70   95    100       90
3        0     0    0      0        0
4     stu4    90   80     70       60
row5     0     0    0      0        0

In [85]:
exam_data = {'name' : [ 'stu1', 'stu2', 'stu3'],
             'math' : [ 90, 80, 70],
             'eng' : [ 98, 89, 95],
             'music' : [ 85, 95, 100],
             'science' : [ 100, 90, 90]}
df = pd.DataFrame(exam_data)

In [86]:
# The column "name" is designated as a new index, and changes are reflected in the df object. 
df.set_index('name', inplace=True)
print(df)

      math  eng  music  science
name
stu1    90   98     85      100
stu2    80   89     95       90
stu3    70   95    100       90

In [87]:
# A method of changing a specific element of the data frame df: 'science' score of 'stu1'
df.iloc[0][3] = 80
print(df)
print('\n')

df.loc['stu1']['science'] = 90
print(df)
print('\n')

df.loc['stu1', 'science'] = 100
print(df)
print('\n')

      math  eng  music  science
name
stu1    90   98     85       80
stu2    80   89     95       90
stu3    70   95    100       90


      math  eng  music  science
name
stu1    90   98     85       90
stu2    80   89     95       90
stu3    70   95    100       90


      math  eng  music  science
name
stu1    90   98     85      100
stu2    80   89     95       90
stu3    70   95    100       90

In [88]:
# A method of changing several elements of a data frame df: 'music', 'science' scores of 'stu1'
df.loc['stu1', ['music', 'science']] = 50
print(df)
print('\n')

df.loc['stu1', ['music', 'science']] = 100, 50
print(df)

      math  eng  music  science
name
stu1    90   98     50       50
stu2    80   89     95       90
stu3    70   95    100       90


      math  eng  music  science
name
stu1    90   98    100       50
stu2    80   89     95       90
stu3    70   95    100       90

In [89]:
exam_data = {'name' : [ 'stu1', 'stu2', 'stu3'],
             'math' : [ 90, 80, 70],
             'eng' : [ 98, 89, 95],
             'music' : [ 85, 95, 100],
             'science' : [ 100, 90, 90]}
df = pd.DataFrame(exam_data)

In [90]:
# To transpose the data frame df (using the method)
df = df.transpose()
print(df)

            0     1     2
name     stu1  stu2  stu3
math       90    80    70
eng        98    89    95
music      85    95   100
science   100    90    90

In [91]:
# Retranspose the data frame df (using the class attributes)
df = df.T
print(df)

   name math eng music science
0  stu1   90  98    85     100
1  stu2   80  89    95      90
2  stu3   70  95   100      90

In [92]:
# A specific column is set as a row index of a data frame
ndf = df.set_index(['name'])
print(ndf)
print('\n')
ndf2 = ndf.set_index('music')
print(ndf2)
print('\n')
ndf3 = ndf.set_index(['math', 'music'])
print(ndf3)

     math eng music science
name
stu1   90  98    85     100
stu2   80  89    95      90
stu3   70  95   100      90


      math eng science
music
85      90  98     100
95      80  89      90
100     70  95      90


           eng science
math music
90   85     98     100
80   95     89      90
70   100    95      90

In [93]:
# Defintion of Dictionary
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}

# Convert the dictionary into a data frame. Specify the index as [r0, r1, r2]
df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
print(df)

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [94]:
# Redesignate the index to [r0, r1, r2, r3, r4]
new_index = ['r0', 'r1', 'r2', 'r3', 'r4']
ndf = df.reindex(new_index)
print(ndf)

     c0   c1   c2    c3    c4
r0  1.0  4.0  7.0  10.0  13.0
r1  2.0  5.0  8.0  11.0  14.0
r2  3.0  6.0  9.0  12.0  15.0
r3  NaN  NaN  NaN   NaN   NaN
r4  NaN  NaN  NaN   NaN   NaN

In [95]:
# Fill in the NaN value generated by reindex with the number 0.
new_index = ['r0', 'r1', 'r2', 'r3', 'r4']
ndf2 = df.reindex(new_index, fill_value=0)
print(ndf2)

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
r3   0   0   0   0   0
r4   0   0   0   0   0

In [96]:
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}

# Convert the dictionary into a data frame. Specify the index as [r0, r1, r2]
df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
print(df)

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [97]:
# Initialize row index to integer.
ndf = df.reset_index()
print(ndf)

  index  c0  c1  c2  c3  c4
0    r0   1   4   7  10  13
1    r1   2   5   8  11  14
2    r2   3   6   9  12  15

In [98]:
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}

# Convert the dictionary into a data frame. Specify the index as [r0, r1, r2]
df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
print(df)

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [99]:
# Sort row indeces in descending order.
ndf = df.sort_index(ascending=False)
print(ndf)

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

In [100]:
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}

# Convert the dictionary into a data frame. Specify the index as [r0, r1, r2]
df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
print(df)

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [101]:
# Sort in descending order based on column c1 
ndf = df.sort_values(by='c1', ascending=False)
print(ndf)

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

In [102]:
# Create pandas series with data from dictionary
student1 = pd.Series({'eng':100, 'math':80, 'science':90})
print(student1)

eng        100
math        80
science     90
dtype: int64

In [103]:
# Divide student's scores per subject by 200
percentage = student1 / 200

print(percentage)
print('\n')
print(type(percentage))

eng        0.50
math       0.40
science    0.45
dtype: float64


<class 'pandas.core.series.Series'>

In [104]:
# Create pandas series with data from dictionary
student1 = pd.Series({'eng':100, 'math':80, 'science':90})
student2 = pd.Series({'science':80, 'eng':90, 'math':80})
print(student1)
print('\n')
print(student2)
print('\n')

eng        100
math        80
science     90
dtype: int64


science    80
eng        90
math       80
dtype: int64

In [105]:
# Perform arithmetic operation on the scores of each subject of the two students.
addition = student1 + student2               #addition
subtraction = student1 - student2            #subtraction
multiplication = student1 * student2         #multiplication
division = student1 / student2               #division
print(type(division))

<class 'pandas.core.series.Series'>

In [106]:
# Combine the results of the arithmetic operation into data frame (series -> data frame)
result = pd.DataFrame([addition, subtraction, multiplication, division], 
                      index=['addition', 'subtraction', 'multiplication', 'division'])
print(result)

                        eng    math   science
addition         190.000000   160.0   170.000
subtraction       10.000000     0.0    10.000
multiplication  9000.000000  6400.0  7200.000
division           1.111111     1.0     1.125

In [107]:
# Create pandas series with data from dictionary
student1 = pd.Series({'eng':np.nan, 'math':80, 'science':90})
student2 = pd.Series({'science':80, 'eng':90})
print(student1)
print('\n')
print(student2)
print('\n')

eng         NaN
math       80.0
science    90.0
dtype: float64


science    80
eng        90
dtype: int64

In [108]:
# Perform an arithmetic calculation with the scores of each subject of the two students (using the operation method)
sr_add = student1.add(student2, fill_value=0)   #addition
sr_sub = student1.sub(student2, fill_value=0)   #subtraction
sr_mul = student1.mul(student2, fill_value=0)   #multiplication
sr_div = student1.div(student2, fill_value=0)   #division

In [109]:
# Combine the results of the arithmetic operation into data frame (series -> data frame)
result = pd.DataFrame([sr_add, sr_sub, sr_mul, sr_div], 
                      index=['addition', 'subtraction', 'multiplication', 'division'])
print(result)

                 eng  math   science
addition        90.0  80.0   170.000
subtraction    -90.0  80.0    10.000
multiplication   0.0   0.0  7200.000
division         0.0   inf     1.125

In [110]:
import seaborn as sns

# Create data frame by selecting two columns 'age', 'fare' from the data set 'titanic'
titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age','fare']]
print(df.head())   # Print only the first five lines
print('\n')
print(type(df))
print('\n')

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500


<class 'pandas.core.frame.DataFrame'>

In [111]:
# Add the number 10 to the data frame
addition = df + 10
print(addition.head())   # Print only the first five lines
print('\n')
print(type(addition))

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500


<class 'pandas.core.frame.DataFrame'>

In [112]:
# Create data frame by selecting two columns 'age', 'fare' from the data set 'titanic'
titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age','fare']]
print(df.tail())          #마지막 5행을 표시
print('\n')
print(type(df))

      age   fare
886  27.0  13.00
887  19.0  30.00
888   NaN  23.45
889  26.0  30.00
890  32.0   7.75


<class 'pandas.core.frame.DataFrame'>

In [113]:
# Add the number 10 to the data frame
addition = df + 10
print(addition.tail())    # Print only the last 5 rows
print('\n')
print(type(addition))

      age   fare
886  37.0  23.00
887  29.0  40.00
888   NaN  33.45
889  36.0  40.00
890  42.0  17.75


<class 'pandas.core.frame.DataFrame'>

In [114]:
# Calculate between data frames (addition - df)
subtraction = addition - df
print(subtraction.tail())   # Print only the last 5 rows
print('\n')
print(type(subtraction))

      age  fare
886  10.0  10.0
887  10.0  10.0
888   NaN  10.0
889  10.0  10.0
890  10.0  10.0


<class 'pandas.core.frame.DataFrame'>